//directions
export const directionsForBanner = [
    { from: 'c625144', to: 'c627904' }, // Минск - Гродно
    { from: 'c627904', to: 'c625144' }, // Гродно - Минск
];
export const directionsForShuttleBanner = [
    {
        from: 'c627904',
        to: 'c622113',
        link: 'http://sharing.miotaxi.by',
        fileNameWeb: 'rent_shuttle-banner_web_carrierId_466.webp',
        fileNameMobile: 'rent_shuttle-banner_mobile_carrierId_466.webp',
    }, // Гродно - Щучин
    {
        from: 'c627904',
        to: 'c611866',
        link: 'http://sharing.miotaxi.by',
        fileNameWeb: 'rent_shuttle-banner_web_carrierId_466.webp',
        fileNameMobile: 'rent_shuttle-banner_mobile_carrierId_466.webp',
    }, // Гродно - Скидель
    {
        from: 'c627904',
        to: 'c624265',
        link: 'http://sharing.miotaxi.by',
        fileNameWeb: 'rent_shuttle-banner_web_carrierId_466.webp',
        fileNameMobile: 'rent_shuttle-banner_mobile_carrierId_466.webp',
    }, // Гродно - Обухово
    {
        from: 'c622113',
        to: 'c611866',
        link: 'http://sharing.miotaxi.by',
        fileNameWeb: 'rent_shuttle-banner_web_carrierId_466.webp',
        fileNameMobile: 'rent_shuttle-banner_mobile_carrierId_466.webp',
    }, // Щучин - Скидель
    {
        from: 'c622113',
        to: 'c624265',
        link: 'http://sharing.miotaxi.by',
        fileNameWeb: 'rent_shuttle-banner_web_carrierId_466.webp',
        fileNameMobile: 'rent_shuttle-banner_mobile_carrierId_466.webp',
    }, // Щучин - Обухово
    {
        from: 'c627904',
        to: 'c625367',
        link: 'http://sharing.miotaxi.by',
        fileNameWeb: 'rent_shuttle-banner_web_carrierId_466.webp',
        fileNameMobile: 'rent_shuttle-banner_mobile_carrierId_466.webp',
    }, // Гродно - Мосты
    {
        from: 'c627904',
        to: 'c12129719',
        link: 'http://sharing.miotaxi.by',
        fileNameWeb: 'rent_shuttle-banner_web_carrierId_466.webp',
        fileNameMobile: 'rent_shuttle-banner_mobile_carrierId_466.webp',
    }, // Гродно - Коробчицы
];

export const directionsForAttentionBanner = [
    { from: 'c626081', to: 'c593116' }, // Лида - Вильнюс
    { from: 'c626081', to: 'c595016' }, // Лида - Шальчининкай
    { from: 'c629634', to: 'c756135' }, // Брест - Варшава
    { from: 'c629634', to: 'c776175' }, // Брест - Бяла Подляска
    { from: 'c627904', to: 'c756135' }, // Гродно - Варшава
    { from: 'c627904', to: 'c776069' }, // Гродно - Белосток
    { from: 'c627904', to: 'c593116' }, // Гродно - Вильнюс
    { from: 'c627904', to: 'c599757' }, // Гродно - Друскининкай
    { from: 'c625144', to: 'c756135' }, // Минск - Варшава
    { from: 'c625144', to: 'c593116' }, // Минск - Вильнюс
    { from: 'c619979', to: 'c593116' }, // Вороново - Вильнюс
    { from: 'c627904', to: 'c598316' }, // Гродно - Каунас
    { from: 'c630429', to: 'c756135' }, // Барановичи - Варшава
    { from: 'c630429', to: 'c6296786' }, // Барановичи - Варшава, аэропорт Фредерик
    { from: 'c630429', to: 'c776069' }, // Барановичи - Белосток
    { from: 'c630429', to: 'c776175' }, // Барановичи - Бяла-Подляска
    { from: 'c630429', to: 'c765876' }, // Барановичи - Люблин

    { from: 'c627800', to: 'c756135' }, // Ивацевичи - Варшава
    { from: 'c627800', to: 'c776175' }, // Ивацевичи - Бяла-Подляска
    { from: 'c627800', to: 'c765876' }, // Ивацевичи - Люблин

    { from: 'c627145', to: 'c756135' }, // Кобрин - Варшава
    { from: 'c627145', to: 'c776175' }, // Кобрин - Бяла-Подляска
    { from: 'c627145', to: 'c765876' }, // Кобрин - Люблин

    { from: 'c756135', to: 'c627145' }, // Варшава - Кобрин
    { from: 'c756135', to: 'c627800' }, // Варшава - Ивацевичи
    { from: 'c756135', to: 'c630429' }, // Варшава - Барановичи
    { from: 'c756135', to: 'c629634' }, // Варшава - Брест
    { from: 'c756135', to: 'c628884' }, // Варшава - Дрогичин
    { from: 'c756135', to: 'c627811' }, // Варшава - Иваново
    { from: 'c756135', to: 'c623549' }, // Варшава - Пинск
    { from: 'c756135', to: 'c625818' }, // Варшава - Лунинец
    { from: 'c756135', to: 'c625228' }, // Варшава - Микашевичи
    { from: 'c756135', to: 'c618815' }, // Варшава - Житковичи
    { from: 'c756135', to: 'c623581' }, // Варшава - Петриков
    { from: 'c756135', to: 'c625324' }, // Варшава - Мозырь
    { from: 'c756135', to: 'c627751' }, // Варшава - Калинковичи
    { from: 'c756135', to: 'c627907' }, // Варшава - Гомель
    { from: 'c756135', to: 'c626081' }, // Варшава - Лида
    { from: 'c756135', to: 'c630468' }, // Варшава - Бобруйск
    { from: 'c756135', to: 'c618806' }, // Варшава - Жлобин
    { from: 'c756135', to: 'c620391' }, // Варшава - Волковыск
    { from: 'c756135', to: 'c622113' }, // Варшава - Щучин

    { from: 'c625144', to: 'c776069' }, // Минск - Белосток
    { from: 'c625144', to: 'c3088171' }, // Минск - Познань
    { from: 'c625144', to: 'c6296876' }, // Минск - Вильнюс аэропорт
    { from: 'c625144', to: 'c598317' }, // Минск - Каунас аэропорт
    { from: 'c625144', to: 'c598316' }, // Минск - Каунас
    { from: 'c625144', to: 'c6296786' }, // Минск - Варшава, аэропорт Фредерик
    { from: 'c625144', to: 'c776175' }, // Минск - Бяла-Подляска
    { from: 'c625144', to: 'c765876' }, // Минск - Люблин
    { from: 'c625144', to: 'c594739' }, // Минск - Шяуляй
    { from: 'c625144', to: 'c594739' }, // Минск - Шяуляй
    { from: 'c625144', to: 'c460413' }, // Минск - Даугавпилс
    { from: 'c460413', to: 'c625144' }, // Минск - Даугавпилс

    { from: 'c621754', to: 'c776069' }, // Слоним - Белосток
    { from: 'c620391', to: 'c776069' }, // Волковыск - Белосток
    { from: 'c776069', to: 'c626081' }, // Белосток - Лида

    { from: 'c627793', to: 'c593116' }, // Ивье - Вильнюс
    { from: 'c627793', to: 'c6296876' }, // Ивье - Вильнюс аэропорт

    { from: 'c593116', to: 'c630468' }, // Вильнюс - Бобруйск
    { from: 'c593116', to: 'c618806' }, // Вильнюс - Жлобин
    { from: 'c593116', to: 'c627907' }, // Вильнюс - Гомель

    { from: 'c629634', to: 'c765876' }, // Брест - Люблин
    { from: 'c629634', to: 'c756938' }, // Брест - Тересполь
    { from: 'c629634', to: 'c759412' }, // Брест - Седльце
    { from: 'c629634', to: 'c8298648' }, // Брест - Варшава, аэропорт Модлин
    { from: 'c629634', to: 'c6296786' }, // Брест - Варшава, аэропорт Фредерик

    { from: 'c3088171', to: 'c629634' }, // Познань - Брест
    { from: 'c3088171', to: 'c630429' }, // Познань - Барановичи
    { from: 'c3088171', to: 'c627907' }, // Познань - Гомель
    { from: 'c3088171', to: 'c630468' }, // Познань - Бобруйск
    { from: 'c3088171', to: 'c618806' }, // Познань - Жлобин

    { from: 'c627907', to: 'c756938' }, // Гомель - Тересполь
    { from: 'c627907', to: 'c776175' }, // Гомель - Бяла-Подляска
    { from: 'c627907', to: 'c759412' }, // Гомель - Седльце
    { from: 'c627907', to: 'c8298648' }, // Гомель - Варшава, аэропорт Модлин
    { from: 'c627907', to: 'c6296786' }, // Гомель - Варшава, аэропорт Фредерик
    { from: 'c627907', to: 'c6296876' }, // Гомель -  Вильнюс аэропорт
    { from: 'c627907', to: 'c598317' }, // Гомель -  Каунас аэропорт
    { from: 'c627907', to: 'c598316' }, // Гомель -  Каунас
    { from: 'c627907', to: 'c594739' }, // Гомель -  Шяуляй

    { from: 'c627751', to: 'c756938' }, // Калинковичи -  Тересполь
    { from: 'c627751', to: 'c776175' }, // Калинковичи -  Бяла-Подляска
    { from: 'c627751', to: 'c759412' }, // Калинковичи -  Седльце
    { from: 'c627751', to: 'c756135' }, // Калинковичи -  Варшава
    { from: 'c627751', to: 'c8298648' }, // Калинковичи -  Варшава, аэропорт Модлин
    { from: 'c627751', to: 'c6296786' }, // Калинковичи -  Варшава, аэропорт Фредерик

    { from: 'c625324', to: 'c756938' }, // Мозырь -  Тересполь
    { from: 'c625324', to: 'c776175' }, // Мозырь -  Бяла-Подляска
    { from: 'c625324', to: 'c759412' }, // Мозырь -  Седльце
    { from: 'c625324', to: 'c756135' }, // Мозырь -  Варшава
    { from: 'c625324', to: 'c8298648' }, // Мозырь -  Варшава, аэропорт Модлин
    { from: 'c625324', to: 'c6296786' }, // Мозырь -  Варшава, аэропорт Фредерик

    { from: 'c623581', to: 'c756938' }, // Петриков -  Тересполь
    { from: 'c623581', to: 'c776175' }, // Петриков -  Бяла-Подляска
    { from: 'c623581', to: 'c759412' }, // Петриков -  Седльце
    { from: 'c623581', to: 'c756135' }, // Петриков -  Варшава
    { from: 'c623581', to: 'c8298648' }, // Петриков -  Варшава, аэропорт Модлин
    { from: 'c623581', to: 'c6296786' }, // Петриков -  Варшава, аэропорт Фредерик

    { from: 'c618815', to: 'c756938' }, // Житковичи -  Тересполь
    { from: 'c618815', to: 'c776175' }, // Житковичи -  Бяла-Подляска
    { from: 'c618815', to: 'c759412' }, // Житковичи -  Седльце
    { from: 'c618815', to: 'c756135' }, // Житковичи -  Варшава
    { from: 'c618815', to: 'c8298648' }, // Житковичи -  Варшава, аэропорт Модлин
    { from: 'c618815', to: 'c6296786' }, // Житковичи -  Варшава, аэропорт Фредерик

    { from: 'c625228', to: 'c756938' }, // Микашевичи -  Тересполь
    { from: 'c625228', to: 'c776175' }, // Микашевичи -  Бяла-Подляска
    { from: 'c625228', to: 'c759412' }, // Микашевичи -  Седльце
    { from: 'c625228', to: 'c756135' }, // Микашевичи -  Варшава
    { from: 'c625228', to: 'c8298648' }, // Микашевичи -  Варшава, аэропорт Модлин
    { from: 'c625228', to: 'c6296786' }, // Микашевичи -  Варшава, аэропорт Фредерик

    { from: 'c625818', to: 'c756938' }, // Лунинец -  Тересполь
    { from: 'c625818', to: 'c776175' }, // Лунинец -  Бяла-Подляска
    { from: 'c625818', to: 'c759412' }, // Лунинец -  Седльце
    { from: 'c625818', to: 'c756135' }, // Лунинец -  Варшава
    { from: 'c625818', to: 'c8298648' }, // Лунинец -  Варшава, аэропорт Модлин
    { from: 'c625818', to: 'c6296786' }, // Лунинец -  Варшава, аэропорт Фредерик

    { from: 'c623549', to: 'c756938' }, // Пинск -  Тересполь
    { from: 'c623549', to: 'c776175' }, // Пинск -  Бяла-Подляска
    { from: 'c623549', to: 'c759412' }, // Пинск -  Седльце
    { from: 'c623549', to: 'c756135' }, // Пинск -  Варшава
    { from: 'c623549', to: 'c8298648' }, // Пинск -  Варшава, аэропорт Модлин
    { from: 'c623549', to: 'c6296786' }, // Пинск -  Варшава, аэропорт Фредерик

    { from: 'c627811', to: 'c756938' }, // Иваново -  Тересполь
    { from: 'c627811', to: 'c776175' }, // Иваново -  Бяла-Подляска
    { from: 'c627811', to: 'c759412' }, // Иваново -  Седльце
    { from: 'c627811', to: 'c756135' }, // Иваново -  Варшава
    { from: 'c627811', to: 'c8298648' }, // Иваново -  Варшава, аэропорт Модлин
    { from: 'c627811', to: 'c6296786' }, // Иваново -  Варшава, аэропорт Фредерик

    { from: 'c628884', to: 'c756938' }, // Дрогичин -  Тересполь
    { from: 'c628884', to: 'c776175' }, // Дрогичин -  Бяла-Подляска
    { from: 'c628884', to: 'c759412' }, // Дрогичин -  Седльце
    { from: 'c628884', to: 'c756135' }, // Дрогичин -  Варшава
    { from: 'c628884', to: 'c8298648' }, // Дрогичин -  Варшава, аэропорт Модлин
    { from: 'c628884', to: 'c6296786' }, // Дрогичин -  Варшава, аэропорт Фредерик

    { from: 'c627145', to: 'c756938' }, // Кобрин -  Тересполь
    { from: 'c627145', to: 'c776175' }, // Кобрин -  Бяла-Подляска
    { from: 'c627145', to: 'c759412' }, // Кобрин -  Седльце
    { from: 'c627145', to: 'c756135' }, // Кобрин -  Варшава
    { from: 'c627145', to: 'c8298648' }, // Кобрин -  Варшава, аэропорт Модлин
    { from: 'c627145', to: 'c6296786' }, // Кобрин -  Варшава, аэропорт Фредерик

    { from: 'c6296786', to: 'c594739' }, // Варшава, аэропорт Фредерик - Шяуляй
    { from: 'c6296786', to: 'c626081' }, // Варшава, аэропорт Фредерик - Лида
    { from: 'c6296786', to: 'c620391' }, // Варшава, аэропорт Фредерик - Волковыск
    { from: 'c6296786', to: 'c622113' }, // Варшава, аэропорт Фредерик - Щучин

    { from: 'c626081', to: 'c776597' }, // Лида - Августов

    { from: 'c618806', to: 'c6296876' }, // Жлобин - Вильнюс аэропорт
    { from: 'c618806', to: 'c598317' }, // Жлобин - Каунас аэропорт
    { from: 'c618806', to: 'c598316' }, // Жлобин - Каунас
    { from: 'c618806', to: 'c594739' }, // Жлобин - Шяуляй

    { from: 'c630468', to: 'c6296876' }, // Бобруйск - Вильнюс аэропорт
    { from: 'c630468', to: 'c598317' }, // Бобруйск - Каунас аэропорт
    { from: 'c630468', to: 'c598316' }, // Бобруйск - Каунас
    { from: 'c630468', to: 'c594739' }, // Бобруйск - Шяуляй

    { from: 'c619979', to: 'c6296876' }, // Вороново - Вильнюс аэропорт
    { from: 'c619979', to: 'c776597' }, // Вороново - Августов
    { from: 'c619979', to: 'c776069' }, // Вороново - Белосток
    { from: 'c619979', to: 'c756135' }, // Вороново - Варшава

    { from: 'c622113', to: 'c776069' }, // Щучин - Белосток
    { from: 'c622113', to: 'c776597' }, // Щучин - Августов

    { from: 'c630429', to: 'c8298648' }, // Барановичи - Варшава, аэропорт Модлин
    { from: 'c625144', to: 'c8298648' }, // Минск - Варшава, аэропорт Модлин
    { from: 'c626081', to: 'c8298648' }, // Барановичи - Варшава, аэропорт Модлин
    { from: 'c629634', to: 'c776175' }, // Брест - Бяла-Подляска

    { from: 'c626081', to: 'c3088171' }, // Лида - Познань
    { from: 'c3088171', to: 'c626081' }, // Познань - Лида

    { from: 'c627907', to: 'c764312' }, // Гомель - Мронгово
    { from: 'c764312', to: 'c627907' }, // Мронгово - Гомель

    { from: 'c618806', to: 'c764312' }, // Жлобин - Мронгово
    { from: 'c764312', to: 'c618806' }, // Мронгово - Жлобин

    { from: 'c630468', to: 'c764312' }, // Бобруйск - Мронгово
    { from: 'c764312', to: 'c630468' }, // Мронгово - Бобруйск

    { from: 'c625144', to: 'c764312' }, // Минск - Мронгово
    { from: 'c764312', to: 'c625144' }, // Мронгово - Минск

    { from: 'c627907', to: 'c763166' }, // Гомель - Ольштын
    { from: 'c763166', to: 'c627907' }, // Ольштын - Гомель

    { from: 'c618806', to: 'c763166' }, // Жлобин - Ольштын
    { from: 'c763166', to: 'c618806' }, // Ольштын - Жлобин

    { from: 'c630468', to: 'c763166' }, // Бобруйск - Ольштын
    { from: 'c763166', to: 'c630468' }, // Ольштын - Бобруйск

    { from: 'c625144', to: 'c763166' }, // Минск - Ольштын
    { from: 'c763166', to: 'c625144' }, // Ольштын - Минск

    { from: 'c627907', to: 'c3099759' }, // Гомель - Эльблонг
    { from: 'c3099759', to: 'c627907' }, // Эльблонг - Гомель

    { from: 'c618806', to: 'c3099759' }, // Жлобин - Эльблонг
    { from: 'c3099759', to: 'c618806' }, // Эльблонг - Жлобин

    { from: 'c630468', to: 'c3099759' }, // Бобруйск - Эльблонг
    { from: 'c3099759', to: 'c630468' }, // Эльблонг - Бобруйск

    { from: 'c625144', to: 'c3099759' }, // Минск - Эльблонг
    { from: 'c3099759', to: 'c625144' }, // Эльблонг - Минск

    { from: 'c627907', to: 'c3099434' }, // Гомель - Гданьск
    { from: 'c3099434', to: 'c627907' }, // Гданьск - Гомель

    { from: 'c618806', to: 'c3099434' }, // Жлобин - Гданьск
    { from: 'c3099434', to: 'c618806' }, // Гданьск - Жлобин

    { from: 'c630468', to: 'c3099434' }, // Бобруйск - Гданьск
    { from: 'c3099434', to: 'c630468' }, // Гданьск - Бобруйск

    { from: 'c625144', to: 'c3099434' }, // Минск - Гданьск
    { from: 'c3099434', to: 'c625144' }, // Гданьск - Минск

    { from: 'c456168', to: 'c625144' }, // аэропорт Рига - Минск
    { from: 'c625144', to: 'c456168' }, // Минск - аэропорт Рига
    { from: 'c625144', to: 'c456172' }, // Минск - Рига
    { from: 'c456172', to: 'c625144' }, // Минск - Рига
];

export const attentionBannersSrc = {
    fileNameWeb: 'attention_banner_web.webp',
    fileNameMobile: 'attention_banner_mobile.webp',
    fileNameIPad: 'attention_banner_iPad.webp',
};

export const directionsForHrodnaEUAttentionBanner = [
    {
        from: 'c627904',
        to: 'c756135',
    }, // Гродно - Варшава
    {
        from: 'c627904',
        to: 'c776069',
    }, // Гродно - Белосток
    {
        from: 'c627904',
        to: 'c776597',
    }, // Гродно - Августов
];

export const attentionHrodnaEUBannersSrc = {
    fileNameWeb: 'attention_banner_hrodna_eu_web.webp',
    fileNameMobile: 'attention_banner_hrodna_eu_mobile.webp',
    fileNameIPad: 'attention_banner_hrodna_eu_iPad.webp',
};

export const directionsForHrodnaBYAttentionBanner = [
    {
        from: 'c627904',
        to: 'c629634',
    }, // Гродно - Брест
    {
        from: 'c627904',
        to: 'c630429',
    }, // Гродно - Барановичи
    {
        from: 'c627904',
        to: 'c626081',
    }, // Гродно - Лида
    {
        from: 'c627904',
        to: 'c620391',
    }, // Гродно - Волковыск
];

export const attentionHrodnaBYBannersSrc = {
    fileNameWeb: 'attention_banner_hrodna_by_web.webp',
    fileNameMobile: 'attention_banner_hrodna_by_mobile.webp',
    fileNameIPad: 'attention_banner_hrodna_by_iPad.webp',
};

// Минск c625144
// Гродно c627904
// Щучин c622113
// Обухово c624265
// Скидель c611866
// Мосты c625367
// Коробчицы c12129719
// Лида c626081
// Вильнюс c593116
// Шальчининкай c595016
// Брест c629634
// Варшава c756135
// Бяла Подляска
// Белосток c776069
// Друскининкай c599757
// Вороново c619979
// Каунас c598316
// Августов c776597
// Барановичи c630429
// Волковыск c620391

//carriers for shuttle banner
export const carriersForShuttleBanner = [
    {
        carrierID: '466',
        link: 'http://sharing.miotaxi.by',
        fileNameWeb: 'rent_shuttle-banner_web_carrierId_466.webp',
        fileNameMobile: 'rent_shuttle-banner_mobile_carrierId_466.webp',
    }, //466
];

// 466 - "ООО Кронон Сервис Шаттл"

export const directionsForKishinevMoscowInfoBanner = [
    {
        from: 'c524901',
        to: 'c618426',
    }, // Москва - Кишинев
    {
        from: 'c618426',
        to: 'c524901',
    }, // Кишинев - Москва
];

export const kishinevMoscowInfoBannerSrc = {
    fileNameWeb: 'kishinev_moscow_info_banner_web.webp',
    fileNameMobile: 'kishinev_moscow_info_banner_mobile.webp',
    fileNameIPad: 'kishinev_moscow_info_banner_iPad.webp',
};

// Москва c524901
// Кишинев c618426
